ماكنتش اعرف اني لازم احل المسألة كلها من الاول ,, وعلى هذا الاساس بعت تسليم التاسك في الاول للجزء التاني بس واكتشتفت عندي غلط
لما حلتها هنا وعدلت الغلط المرة دي
آسف ع اللخبطة دي :)
-----------------------------------------------
The Relationship of A(0,n) is : 
2 * n
-----------------------------------------------
** A(1,10)
A(0 , A( 1 , 9 ))
A(0 , A[ 0 , A ( 1 , 8 )])
A(0 , A[ 0 , A[ 0 , A ( 1 , 7 )]])
A(0 , A[ 0 , A[ 0 , A[ 0 , A ( 1 , 6 )]]])
A(0 , A[ 0 , A[ 0 , A[ 0 , A[ 0 , A ( 1 , 5 )]]]])
A(0 , A[ 0 , A[ 0 , A[ 0 , A[ 0 , A[ 0 , A ( 1 , 4 )]]]]])
A(0 , A[ 0 , A[ 0 , A[ 0 , A[ 0 , A[ 0 , A[ 0 , A ( 1 , 3 )]]]]]])
A(0 , A[ 0 , A[ 0 , A[ 0 , A[ 0 , A[ 0 , A[ 0 , A[ 0 , A ( 1 , 2 )]]]]]]])
A(0 , A[ 0 , A[ 0 , A[ 0 , A[ 0 , A[ 0 , A[ 0 , A[ 0 , A[ 0 , A ( 1 , 1 )]]]]]]]])
A(0 , A[ 0 , A[ 0 , A[ 0 , A[ 0 , A[ 0 , A[ 0 , A[ 0 , A[ 0 , 2]]]]]]]])
A(0 , A[ 0 , A[ 0 , A[ 0 , A[ 0 , A[ 0 , A[ 0 , A[ 0 , 4]]]]]]])
A(0 , A[ 0 , A[ 0 , A[ 0 , A[ 0 , A[ 0 , A[ 0 , 8]]]]]])
A(0 , A[ 0 , A[ 0 , A[ 0 , A[ 0 , A[ 0 , 16]]]]])
A(0 , A[ 0 , A[ 0 , A[ 0 , A[ 0 , 32]]]])
A(0 , A[ 0 , A[ 0 , A[ 0 , 64]]])
A(0 , A[ 0 , A[ 0 , 128]])
A(0 , A[ 0 , 256])
A(0 , 512)
1024                       
The Relationship of A(1,n) is : 
2^n if n > 0
0   if n = 0 
-------------------------------------------------
** A ( 2 , 4 )
A ( 1 , A ( 2 , 3 ))
A ( 1 , A [ 1 , A ( 2 , 2 )])
A ( 1 , A [ 1 , A [ 1 , A ( 2 , 1 )]])
A ( 1 , A [ 1 , A [ 1 , 2]])  >>>>>>>> from the above ,, A [1,2] = 2 ^ 2 = 4
A ( 1 , A [ 1 , 4]) >>>>>>>>> A [1,4] = 2 ^ 4 = 16
A ( 1 , 16) >>>>>> A [1,16] = 2^16 = 65536
The Relationship of A(2,n) is : 
0       if n = 0
2^(n)   if n = 1 || n = 2
2^(n+1) if n = 3
2^(n^2) if n = 4
--------------------------------------------------
** A(3,3)
A ( 2 , A ( 3 , 2 ))
A ( 2 , A[ 2 , A ( 3 , 1 )])
A ( 2 , A[ 2 , 2 ]) >>>>>>>> from the above ,, A [2,2] = 4
A ( 2 , 4 ) >>>>>>>> from the above ,, A [2,4] = 655536
65536
